# RbsPipeTypeFittingLossTableParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsPipeTypeFittingLossTableParam Property
ParameterTypeId Class See Also
---
"K Coefficient Table"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsPipeTypeFittingLossTableParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsPipeTypeFittingLossTableParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsPipeTypeFittingLossTableParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace